Repository: adslbarxatov/BatchImageConvertor
Catalog: src/BatchImageConvertor_*.resx
Languages: ru_ru

# AbsoluteSizeText
source: Set size to:
ru_ru: Задать размер:

# AlphaColumn
source: Alpha channel
ru_ru: Альфа-канал

# BitmapRadioText
source: Only black and white
ru_ru: Только чёрный и белый

# BStart
source: &Begin conversion
ru_ru: &Начать преобразование

# ChangePaletteDialogTitle
source: Select file for palette’s replacement
ru_ru: Укажите файл для замены палитры

# ColorColumn
source: Color
ru_ru: Цвет

# ColorsCountExceedsRecommended
source: Quantity of colors in the current palette exceeds the recommended value (256). Some apps may not support it. Continue?
ru_ru: Количество цветов в текущей палитре больше рекомендуемого (256). Некоторые приложения могут не поддерживать палитры таких размеров. Продолжить?

# ColorTab
source: Coloring
ru_ru: Цвета

# CWLabelText
source: Rotate CW
ru_ru: 1. Повернуть по ч. с. на

# DebugRequired
source: Functions call sequence is incorrect. Debug is required
ru_ru: Ошибка порядка вызова функций. Требуется отладка приложения

# FileGeneric
source: File “{0:S}”:
ru_ru: Файл «{0:S}»:

# FileIncorrect
source: file is broken or has unsupported format
ru_ru: файл повреждён или не поддерживается

# FileOverwrite
source: failed to save: result file already exists
ru_ru: не удалось сохранить файл, т.к. конечный файл уже существует

# FileProcessed
source: File processed: “{0:S}”
ru_ru: Файл обработан: «{0:S}»

# FileUnavailable
source: file is unavailable
ru_ru: файл не найден или недоступен

# FlipComboItems1
source: (no flip)
ru_ru: (не отражать)

# FlipComboItems3
source: vertically
ru_ru: по горизонтали

# FlipComboItems4
source: both
ru_ru: по вертикали

# FlipComboItems2
source: horizontally
ru_ru: по обеим осям

# FlipLabelText
source: Flip
ru_ru: 2. Отразить по

# GreyscaleRadioText
source: Greyscale
ru_ru: Оттенки серого

# IncludeSubdirsText
source: Include s&ubdirectories
ru_ru: Включая по&дпапки

# IncorrectAlpha
source: Specified alpha channel value is incorrect. Must be between 0 and 255 (including)
ru_ru: Введённое значение альфа-канала некорректно. Допустимые значения – между 0 и 255 (включительно)

# InputFolderDescription
source: Select the directory with source images
ru_ru: Выберите директорию, изображения из которой требуется преобразовать

# InputPathNotSpecified
source: Directory with source images not specified
ru_ru: Директория с исходными изображениями не задана

# InputPathUnavailable
source: Specified input directory is unavailable
ru_ru: Указанная директория с исходными изображениями недоступна

# NotEnoughMemory
source: not enough memory for processing
ru_ru: недостаточно памяти для обработки

# OpacityLabel
source: Opacity (alpha channel; 0 – 255):
ru_ru: Непрозрачность (альфа-канал; 0 – 255):

# OpenPaletteDialogTitle
source: Select file for palette loading or extracting
ru_ru: Выберите файл для загрузки/извлечения палитры

# OutputFolderDescription
source: Select the directory for result images. Matching files WILL NOT BE OVERWRITTEN!
ru_ru: Выберите директорию для сохранения преобразованных изображений. При совпадении имён файлов ПЕРЕЗАПИСЬ НЕ ВЫПОЛНЯЕТСЯ!

# OutputPathNotSpecified
source: Directory for result images not specified
ru_ru: Директория для преобразованных изображений не задана

# OutputPathUnavailable
source: cannot save: output file or directory are not writable
ru_ru: не удалось сохранить файл, т.к. файл или конечная директория недоступны для записи

source: Palettes &manager
ru_ru: &Менеджер палитр

# PalettesNotFound
source: file doesn’t contain palettes
ru_ru: файл не содержит палитр

# ProcessingList
source: Building of the processing list...
ru_ru: Формирование списка изображений для обработки...

# ProcessingText
source: Processing: {0:S}
ru_ru: Обрабатывается: {0:S}

# RelativeCropText
source: Crop to (a x b) with offset (c; d):
ru_ru: Обрезать до (a x b) с отступом (c; d):

# RelativeSizeText
source: Resize to:
ru_ru: Изменить до:

# ResultText
source: Processed – {0:D}; successes – {1:D}
ru_ru: Обработано – {0:D}; успешно – {1:D}

# RotationTab
source: Flip and rotation
ru_ru: Поворот и отражение

# SaveColorsRadioText
source: Save colors
ru_ru: Сохранить цвета

# SavePaletteDialogTitle
source: Specify output file’s placement
ru_ru: Укажите расположение для сохранения файла

# ShowVideo
source: Do you want to view the user videoguide on our YouTube channel?
ru_ru: Показать видеоруководство пользователя на нашем YouTube-канале?

# SizeTab
source: Resizing
ru_ru: Размеры

source: Supported file types
ru_ru: Поддерживаемые типы входных файлов

# TooMuchColors
source: Current format doesn’t support this quantity of colors. It should be between 1 and
ru_ru: Количество цветов в текущей палитре недопустимо для выбранного формата. Допустимый диапазон: 1 –

# UnsupportedColors
source: some colors haven’t been loaded because of absence of support for their color spaces in the current version of application
ru_ru: некоторые цвета не были загружены, т.к. их цветовые пространства не поддерживаются в данной реализации программы

# IncorrectCropValues
source: Sum of crop offset and crop size exceeds image dimensions (> 100%)
ru_ru: Сумма смещения и размера обрезки превышает размеры изображения (> 100%)

# CropCenterText
source: Center
ru_ru: Центр

# ComponentMissing
source: A recommended app component is missing: “{0:S}”. Do you want to open project’s webpage to download it manually? You can continue using default functions without it
ru_ru: Отсутствует необходимый компонент программы: «{0:S}». Вы можете продолжить использовать стандартные функции без него

source: Do nothing
ru_ru: Не менять

# InputLabel
source: Input folder:
ru_ru: Входная папка:

# LoadingTab
source: Loading and saving
ru_ru: Загрузка и сохранение

# OthersTab
source: Other
ru_ru: Прочее

# OutputFormatLabel
source: Output format:
ru_ru: Выходной формат:

# OutputLabel
source: Output folder:
ru_ru: Выходная папка:

# ThresholdLabel
source: Conversion threshold:
ru_ru: Порог преобразования:
